astb_relise/src/Documents/РемонтСредствЗащиты/РемонтСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтСредствЗащиты</name>
  <basedOn>Document.РемонтСредствЗащиты</basedOn>
  <registerRecords>AccumulationRegister.РемонтСредствЗащиты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодИзделия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРемонтаСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтСредствЗащиты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтуНеПодлежит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонт</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтаСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/ОсновноеМестоРаботыСотрудника/ОсновноеМестоРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновноеМестоРаботыСотрудника</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </resources>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ШтрихкодыНоменклатурыДляУчетаЧистки/ШтрихкодыНоменклатурыДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатурыДляУчетаЧистки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ЦеныРемонта/ЦеныРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныРемонта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтаСИЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыОперацийРемонтаСИЗ/ВидыОперацийРемонтаСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРемонтаСИЗ</name>
  <enumValues>
    <name>ПередачаВРемонт</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРемонта</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/РемонтСредствЗащиты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РемонтСредствЗащитыРемонт.Ссылка.Дата КАК Период,
	|	РемонтСредствЗащитыРемонт.Ссылка.Организация КАК Организация,
	|	РемонтСредствЗащитыРемонт.Ссылка.Контрагент КАК Контрагент,
	|	РемонтСредствЗащитыРемонт.Ссылка.ШтрихкодИзделия КАК ШтрихкодИзделия,
	|	РемонтСредствЗащитыРемонт.НомерСтроки КАК НомерСтроки,
	|	РемонтСредствЗащитыРемонт.ВидРемонта КАК ВидРемонта,
	|	РемонтСредствЗащитыРемонт.Количество КАК Количество
	|ИЗ
	|	Документ.РемонтСредствЗащиты.Ремонт КАК РемонтСредствЗащитыРемонт
	|ГДЕ
	|	РемонтСредствЗащитыРемонт.Ссылка = &Ссылка
	|	И НЕ РемонтСредствЗащитыРемонт.Ссылка.РемонтуНеПодлежит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РемонтСредствЗащитыРемонт.Ссылка.Дата КАК Период,
	|	РемонтСредствЗащитыРемонт.Ссылка.Организация КАК Организация,
	|	РемонтСредствЗащитыРемонт.Ссылка.Контрагент КАК Контрагент,
	|	РемонтСредствЗащитыРемонт.Ссылка.ШтрихкодИзделия КАК ШтрихкодИзделия,
	|	РемонтСредствЗащитыРемонт.НомерСтроки КАК НомерСтроки,
	|	РемонтСредствЗащитыРемонт.ВидРемонта КАК ВидРемонта,
	|	РемонтСредствЗащитыРемонт.Количество КАК Количество
	|ИЗ
	|	Документ.РемонтСредствЗащиты.Ремонт КАК РемонтСредствЗащитыРемонт
	|ГДЕ
	|	РемонтСредствЗащитыРемонт.Ссылка = &Ссылка
	|	И НЕ РемонтСредствЗащитыРемонт.Ссылка.РемонтуНеПодлежит";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПриходПоРегистру = Результат[0].Выгрузить();
	РасходПоРегистру = Результат[1].Выгрузить();
	
	Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРемонтаСИЗ.ВозвратИзРемонта Тогда
		ТаблицаДвижений = РасходПоРегистру;
	ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРемонтаСИЗ.ПередачаВРемонт Тогда
		ТаблицаДвижений = ПриходПоРегистру;
	Иначе
		ТаблицаДвижений = ПриходПоРегистру;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасходПоРегистру,ТаблицаДвижений);
	КонецЕсли;
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ТаблицыДляДвижений.Вставить("ТаблицаРемонтСредствЗащиты", ТаблицаДвижений);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачи") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"АктПриемаПередачи",
			"Акт приема-передачи",
			СформироватьПечатнуюФормуАктаПриемаПередачи(МассивОбъектов, ОбъектыПечати),,"Документ.РемонтСредствЗащиты.ПФ_MXL_АктПриемаПередачи");
				
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"АктВыполненныхРабот",
			"Акт выполненных работ",
			СформироватьПечатнуюФормуАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати),,"Документ.РемонтСредствЗащиты.ПФ_MXL_АктВыполненныхРабот");
				
	КонецЕсли;	
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуАктаПриемаПередачи(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РемонтСредствЗащиты_АктПриемаПередачи";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудника.Период КАК Период,
	|	ОсновноеМестоРаботыСотрудника.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудника.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудника.МоментВремени КАК МоментВремени,
	|	ОсновноеМестоРаботыСотрудника.ОсновноеМестоРаботы КАК ОсновноеМестоРаботы,
	|	ОсновноеМестоРаботыСотрудника.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновныеМестаРаботыСотрудников
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника КАК ОсновноеМестоРаботыСотрудника
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудника.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ОсновныеМестаРаботыСотрудников.Период, &Период)) КАК КонецПериода
	|ПОМЕСТИТЬ ВТ_ПериодыРаботыСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ОсновныеМестаРаботыСотрудников.Период КАК Период,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник КАК Сотрудник,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Подразделение КАК Подразделение,
	|		ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени КАК МоментВремени,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Должность КАК Должность
	|	ИЗ
	|		ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|	ГДЕ
	|		ВТ_ОсновныеМестаРаботыСотрудников.ОсновноеМестоРаботы) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|		ПО ВложенныйЗапрос.Сотрудник = ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник
	|			И ВложенныйЗапрос.МоментВремени < ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РемонтСредствЗащиты.Ссылка КАК Ссылка,
	|	РемонтСредствЗащиты.Номер КАК НомерДокумента,
	|	РемонтСредствЗащиты.Дата КАК Дата,
	|	РемонтСредствЗащиты.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	РемонтСредствЗащиты.Контрагент.НаименованиеПолное КАК ПредставлениеКонтрагента,
	|	РемонтСредствЗащиты.Ответственный.Наименование КАК Ответственный,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Наименование КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.Наименование КАК Размер,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.ЕдиницаИзмерения.Наименование КАК Единица
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	Документ.РемонтСредствЗащиты КАК РемонтСредствЗащиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|		ПО РемонтСредствЗащиты.ШтрихкодИзделия = ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод
	|ГДЕ
	|	РемонтСредствЗащиты.Ссылка В(&МассивОбъектов)
	|	И НЕ РемонтСредствЗащиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРемонтаСИЗ.ВозвратИзРемонта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Ссылка КАК Ссылка,
	|	ВТ_Результат.НомерДокумента КАК НомерДокумента,
	|	ВТ_Результат.Дата КАК ДатаДокумента,
	|	ВТ_Результат.ПредставлениеОрганизации КАК ПредставлениеОрганизации,
	|	ВТ_Результат.ПредставлениеКонтрагента КАК ПредставлениеКонтрагента,
	|	ВТ_Результат.Ответственный КАК Ответственный,
	|	ВТ_Результат.Сотрудник.Наименование КАК Сотрудник,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.Размер КАК Размер,
	|	ВТ_Результат.Единица КАК Единица,
	|	ВТ_ПериодыРаботыСотрудников.Должность.Наименование КАК ДолжностьСотрудника
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыРаботыСотрудников КАК ВТ_ПериодыРаботыСотрудников
	|		ПО ВТ_Результат.Сотрудник = ВТ_ПериодыРаботыСотрудников.Сотрудник
	|			И ВТ_Результат.Дата <= ВТ_ПериодыРаботыСотрудников.КонецПериода
	|			И ВТ_Результат.Дата > ВТ_ПериодыРаботыСотрудников.НачалоПериода";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Период", 		ТекущаяДата());
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РемонтСредствЗащиты.ПФ_MXL_АктПриемаПередачи");
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
	
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДокумента");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ОбластьМакета.Параметры.ПредставлениеСотрудника 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Сотрудник);
		ОбластьМакета.Параметры.ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РемонтСредствЗащиты_АктВыполненныхРабот";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтСредствЗащиты.Ссылка КАК Ссылка,
	|	РемонтСредствЗащиты.Номер КАК Номер,
	|	РемонтСредствЗащиты.Дата КАК Дата,
	|	РемонтСредствЗащиты.Организация.НаименованиеПолное КАК ПредставлениеЗаказчика,
	|	РемонтСредствЗащиты.Организация.Префикс КАК Префикс,
	|	РемонтСредствЗащиты.Контрагент.НаименованиеПолное КАК ПредставлениеИспольнителя,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.Наименование КАК ПредставлениеСотрудника,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Наименование КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.Наименование КАК Размер,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.ЕдиницаИзмерения.Наименование КАК Единица,
	|	РемонтСредствЗащиты.ШтрихкодИзделия КАК ШтрихкодИзделия
	|ИЗ
	|	Документ.РемонтСредствЗащиты КАК РемонтСредствЗащиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|		ПО РемонтСредствЗащиты.ШтрихкодИзделия = ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод
	|ГДЕ
	|	РемонтСредствЗащиты.Ссылка В(&МассивОбъектов)
	|	И НЕ РемонтСредствЗащиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРемонтаСИЗ.ПередачаВРемонт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РемонтСредствЗащитыРемонт.Ссылка КАК Ссылка,
	|	РемонтСредствЗащитыРемонт.НомерСтроки КАК НомерСтроки,
	|	РемонтСредствЗащитыРемонт.ВидРемонта КАК ВидРемонта,
	|	РемонтСредствЗащитыРемонт.Количество КАК Количество
	|ИЗ
	|	Документ.РемонтСредствЗащиты.Ремонт КАК РемонтСредствЗащитыРемонт
	|ГДЕ
	|	РемонтСредствЗащитыРемонт.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РемонтСредствЗащиты.ПФ_MXL_АктВыполненныхРабот");
	
	ПакетЗапросов 		= Запрос.ВыполнитьПакет();
	ДанныеПечати 		= ПакетЗапросов[0].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Акт о приемке выполненных работ");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.КоличествоСтрок = ДанныеПечати.Ссылка.Ремонт.Количество();
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуВидаРемонта(ВидРемонта, ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныРемонтаСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныРемонта.СрезПоследних(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И ВидРемонта = &ВидРемонта) КАК ЦеныРемонтаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаАнализа",ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Контрагент",	ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("ВидРемонта",	ВидРемонта);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Результат.Выгрузить()[0].Цена;
	КонецЕсли;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Акт приема-передачи
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РемонтСредствЗащиты";
	КомандаПечати.Идентификатор = "АктПриемаПередачи";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//Акт выполненных работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РемонтСредствЗащиты";
	КомандаПечати.Идентификатор = "АктВыполненныхРабот";
	КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(ДанныеЗаполнения,Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект.Организация 			= ДанныеЗаполнения.Организация;
	Объект.Контрагент 			= ДанныеЗаполнения.Контрагент;
	Объект.ШтрихкодИзделия 		= ДанныеЗаполнения.ШтрихкодИзделия;
	Объект.ВидОперации 			= Перечисления.ВидыОперацийРемонтаСИЗ.ВозвратИзРемонта;
	Объект.ДокументОснование	= ДанныеЗаполнения.Ссылка;
	Объект.СуммаДокумента 		= ДанныеЗаполнения.СуммаДокумента;
	Объект.Комментарий 			= ДанныеЗаполнения.Комментарий;
	Объект.Ответственный 		= ДанныеЗаполнения.Ответственный;
	Объект.Ремонт.Загрузить(ДанныеЗаполнения.Ремонт.Выгрузить());
	
КонецПроцедуры

#КонецЕсли
